In [1]:
import pandas as pd

In [24]:
Olympics=pd.read_csv("Paris 2024 Olympics_Nations Medals.csv")
Olympics.head()

   NOC  Gold  Silver  Bronze  Total
0  USA    40      44      42    126
1  CHN    40      27      24     91
2  JPN    20      12      13     45
3  AUS    18      19      16     53
4  FRA    16      26      22     64

****select a subset of a DataFrame****

****select specific columns from a DataFrame****

I’m interested in the gold column of the Olympic dataframe.

In [3]:
gold=Olympics["Gold"]
gold.head()

0    40
1    40
2    20
3    18
4    16
Name: Gold, dtype: int64

To select a single column, use square brackets [] with the column name of the column of interest.

Each column in a DataFrame is a Series. As a single column is selected, the returned object is a pandas Series. We can verify this by checking the type of the output:

In [5]:
type(Olympics["Gold"])

pandas.core.series.Series

And have a look at the shape of the output:

In [6]:
Olympics["Gold"].shape

(91,)

****DataFrame.shape**** is an attribute (remember tutorial on reading and writing, do not use parentheses for attributes) of a pandas Series and DataFrame containing the number of rows and columns: (nrows, ncolumns). A pandas Series is 1-dimensional and only the number of rows is returned.

I’m interested in the Gold  and Silver of the OLympics.

In [8]:
gold_silver=Olympics[["Gold","Silver"]]
gold_silver.head()

   Gold  Silver
0    40      44
1    40      27
2    20      12
3    18      19
4    16      26

****Note****

The inner square brackets define a Python list with column names, whereas the outer brackets are used to select the data from a pandas DataFrame as seen in the previous example.

The returned data type is a pandas DataFrame:

In [9]:
type(Olympics[["Gold","Silver"]])

pandas.core.frame.DataFrame

In [10]:
Olympics[["Gold","Silver"]].shape

(91, 2)

****filter specific rows from a DataFrame****

I’m interested in NOC who have won more than 35 Glod

In [11]:
above_35=Olympics[Olympics['Gold']>35]
above_35.head()

   NOC  Gold  Silver  Bronze  Total
0  USA    40      44      42    126
1  CHN    40      27      24     91

To select rows based on a conditional expression, use a condition inside the selection brackets [].

The condition inside the selection brackets titanic["Gold"] > 35 checks for which rows the Gold column has a value larger than 35:

In [13]:
Olympics['Gold']>35

0      True
1      True
2     False
3     False
4     False
      ...
86    False
87    False
88    False
89    False
90    False
Name: Gold, Length: 91, dtype: bool

The output of the conditional expression (>, but also ==, !=, <, <=,… would work) is actually a pandas Series of boolean values (either True or False) with the same number of rows as the original DataFrame. Such a Series of boolean values can be used to filter the DataFrame by putting it in between the selection brackets []. Only rows for which the value is True will be selected.

We know from before that the original Olympics DataFrame consists of 91 rows. Let’s have a look at the number of rows which satisfy the condition by checking the shape attribute of the resulting DataFrame above_35:

In [16]:
above_35.shape

(2, 5)

I’m interested in the Olympics NOC from Silver  medal 2 and 3.

In [18]:
class_23=Olympics[Olympics["Silver"].isin([2,3])]
class_23.head()

    NOC  Gold  Silver  Bronze  Total
12  UZB     8       2       3     13
16  KEN     4       2       5     11
23  GEO     3       3       1      7
28  DEN     2       2       5      9
29  CRO     2       2       3      7

Similar to the conditional expression, the isin() conditional function returns a True for each row the values are in the provided list. To filter the rows based on such a function, use the conditional function inside the selection brackets [].
In this case, the condition inside the selection brackets Olympics["Silver"].isin([2, 3]) checks for which rows the Silver column is either 2 or 3.

The above is equivalent to filtering by rows for which the class is either 2 or 3 and combining the two statements with an | (or) operator:

In [20]:
class_23=Olympics[(Olympics["Silver"]==2)|(Olympics["Silver"]==3)]
class_23.head()

    NOC  Gold  Silver  Bronze  Total
12  UZB     8       2       3     13
16  KEN     4       2       5     11
23  GEO     3       3       1      7
28  DEN     2       2       5      9
29  CRO     2       2       3      7

****Note****

When combining multiple conditional statements, each condition must be surrounded by parentheses (). Moreover, you can not use or/and but need to use the or operator | and the and operator &.

I want to work with Olympics data for which the gold  is known.

In [27]:

gold_no_na=Olympics[Olympics["Gold"].notna()]
gold_no_na.head()

   NOC  Gold  Silver  Bronze  Total
0  USA    40      44      42    126
1  CHN    40      27      24     91
2  JPN    20      12      13     45
3  AUS    18      19      16     53
4  FRA    16      26      22     64

The notna() conditional function returns a True for each row the values are not a Null value. As such, this can be combined with the selection brackets [] to filter the data table.

You might wonder what actually changed, as the first 5 lines are still the same values. One way to verify is to check if the shape has changed:

In [30]:
gold_no_na.shape

(91, 5)

****select specific rows and columns from a DataFrame****

I’m interested in the names of the NOC who have more than 30 gold.

In [34]:
above_30goldwin_NOC=Olympics.loc[Olympics["Gold"]>30,"NOC"]
above_30goldwin_NOC.head()

0    USA
1    CHN
Name: NOC, dtype: object

In this case, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. The loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

When using the column names, row labels or a condition expression, use the loc operator in front of the selection brackets []. For both the part before and after the comma, you can use a single label, a list of labels, a slice of labels, a conditional expression or a colon. Using a colon specifies you want to select all rows or columns.

****I’m interested in rows 10 till 25 and columns 2 to 4.****

In [35]:
Olympics.iloc[9:25,1:4]

    Gold  Silver  Bronze
9     12      13       8
10    10       7       3
11     9       7      11
12     8       2       3
13     6       7       6
14     5       4       9
15     4       4       3
16     4       2       5
17     4       1       3
18     4       0       3
19     3       7      10
20     3       6       3
21     3       5       4
22     3       4       2
23     3       3       1
24     3       1       6

Again, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. When specifically interested in certain rows and/or columns based on their position in the table, use the iloc operator in front of the selection brackets [].

When selecting specific rows and/or columns with loc or iloc, new values can be assigned to the selected data. For example, to assign the name "NOT WON to the first 3 elements of the fourth column:

In [38]:
Olympics.iloc[0:3,3]="NOT WON"
Olympics.head()

   NOC  Gold  Silver   Bronze  Total
0  USA    40      44  NOT WON    126
1  CHN    40      27  NOT WON     91
2  JPN    20      12  NOT WON     45
3  AUS    18      19       16     53
4  FRA    16      26       22     64

****REMEMBER****

When selecting subsets of data, square brackets [] are used.

Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.

Select specific rows and/or columns using loc when using the row and column names.

Select specific rows and/or columns using iloc when using the positions in the table.

You can assign new values to a selection based on loc/iloc.